Revit 2027 API
OBJExportOptions.IsSurfaceToleranceSet Method
 Checks whether the SurfaceTolerance tessellation parameter is explicitly set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSurfaceToleranceSet()
Public Function IsSurfaceToleranceSet As Boolean
public:
bool IsSurfaceToleranceSet()
member IsSurfaceToleranceSet : unit -> bool
Return Value
Boolean
 True if SurfaceTolerance tessellation parameter is explicitly set, false otherwise.
See Also
Reference
OBJExportOptions Class
Autodesk.Revit.DB Namespace